000_РОЗНИЦА_ЦЕНТР/src/Catalogs/АдресаСлужбыДоставки/АдресаСлужбыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АдресаСлужбыДоставки</name>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДГорода</name>
    <type>
      <types>CatalogRef.ГородаДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДУлицы</name>
    <type>
      <types>CatalogRef.Улицы</types>
    </type>
  </attributes>
  <attributes>
    <name>Дом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.КонтрагентыСлужбыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Флаг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Квартира</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/АдресаСлужбыДоставки/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПараметрыАдреса = Новый Структура;
	ПараметрыАдреса.Вставить("АдресИнд", ТекущийОбъект.Идентификатор);
	ПараметрыАдреса.Вставить("Контрагент", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Контрагент, "Идентификатор"));
	ПараметрыАдреса.Вставить("ИДУлицы", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.ИДУлицы, "Идентификатор"));
	ПараметрыАдреса.Вставить("Дом", ТекущийОбъект.Дом);
	ПараметрыАдреса.Вставить("Квартира", ТекущийОбъект.Квартира);
	ПараметрыАдреса.Вставить("Примечание", ТекущийОбъект.Примечание);
	
	СтруктураОтвета = ОбменНПСервер.АдресКонтрагентаЗаписать(ПараметрыАдреса);
	
	Если СтруктураОтвета.Ошибка Тогда
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтруктураОтвета.ТектОшибки, , , , Отказ);
		
	Иначе
		
		ТекущийОбъект.Идентификатор = СтруктураОтвета.АдресИнд;
		ТекущийОбъект.Адрес = СтруктураОтвета.Адрес;
		
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИДГородаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

    СтандартнаяОбработка = Ложь;
    ДанныеВыбора = ГородАвтоПодборНаСервере(Текст);

КонецПроцедуры


&НаКлиенте
Процедура ИДУлицыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

    СтандартнаяОбработка = Ложь;
    ДанныеВыбора = УлицаАвтоПодборНаСервере(Текст, Объект.ИДГорода);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ГородАвтоПодборНаСервере(Текст)
	
	Возврат ОбменНПСервер.ГородАвтоПодбор(Текст);

КонецФункции

&НаСервереБезКонтекста
Функция УлицаАвтоПодборНаСервере(Текст, Город)
	
	Возврат ОбменНПСервер.УлицаАвтоПодбор(Текст, Город);

КонецФункции

#КонецОбласти
